cfe llm/Catalogs/AI_КартыИзвлечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_КартыИзвлечения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменятьСтрокиТабличныхЧастей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоискПоНаименованию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбиратьИзСписка</Name>							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<Attribute>
				<Properties>
					<Name>ОбновлятьСтрокиПоНомеру</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_КартыИзвлечения/Ext/ObjectModule.bsl
// Ключ в ответе — имя поля в схеме, по которой отвечает модель. Придумывать
// его администратору незачем: пустой ключ выводится из реквизита объекта,
// свойства или названия поля.
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Заменить строки целиком и дописать значения в существующие по номеру —
	// противоположные вещи: при записи сработало бы что-то одно, и не то.
	Если ЗаменятьСтрокиТабличныхЧастей И ОбновлятьСтрокиПоНомеру Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Строки табличных частей либо заменяются целиком, либо обновляются"
			+ " по номеру — отметьте что-то одно.";
		Сообщение.Поле = "ОбновлятьСтрокиПоНомеру";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Занятые = Новый Соответствие;
	Для Каждого Поле Из Поля Цикл
		Если ЗначениеЗаполнено(СокрЛП(Поле.Ключ)) Тогда
			Занятые.Вставить(НРег(СокрЛП(Поле.Ключ)), Истина);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Поле Из Поля Цикл
		Если ЗначениеЗаполнено(СокрЛП(Поле.Ключ)) Тогда
			Продолжить;
		КонецЕсли;
		Основа = СокрЛП(Поле.ПутьРеквизита);
		Если Не ЗначениеЗаполнено(Основа) Тогда
			Основа = СокрЛП(Поле.ДополнительныйРеквизит);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Основа) Тогда
			Основа = СокрЛП(Поле.Представление);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Основа) Тогда
			Продолжить;
		КонецЕсли;

		Ключ = КлючИзНазвания(Основа);
		Кандидат = Ключ;
		Номер = 1;
		Пока Занятые.Получить(Кандидат) <> Неопределено Цикл
			Номер = Номер + 1;
			Кандидат = Ключ + "_" + Формат(Номер, "ЧГ=0");
		КонецЦикла;
		Поле.Ключ = Кандидат;
		Занятые.Вставить(Кандидат, Истина);
	КонецЦикла;

КонецПроцедуры

// Латинское имя в стиле snake_case: «РегистрационныйНомер» → «registratsionnyy_nomer».
// Модели понятнее осмысленное имя, чем «field_7», а схеме нужна латиница.
Функция КлючИзНазвания(Название)

	Замены = Новый Соответствие;
	Для Каждого Пара Из СтрРазделить("а=a,б=b,в=v,г=g,д=d,е=e,ё=e,ж=zh,з=z,и=i,й=y,к=k,л=l,"
		+ "м=m,н=n,о=o,п=p,р=r,с=s,т=t,у=u,ф=f,х=kh,ц=ts,ч=ch,ш=sh,щ=shch,ъ=,ы=y,ь=,э=e,ю=yu,я=ya", ",") Цикл
		Части = СтрРазделить(Пара, "=", Истина);
		Замены.Вставить(Части[0], Части[1]);
	КонецЦикла;

	Результат = "";
	Разделитель = Истина;
	ПредыдущаяСтрочная = Ложь;
	Для Позиция = 1 По СтрДлина(Название) Цикл
		Символ = Сред(Название, Позиция, 1);
		Нижний = НРег(Символ);
		// Граница слова в ИменахВотТак — заглавная буква после строчной;
		// аббревиатура «НДС» остается одним словом.
		Заглавная = (Символ <> Нижний);
		Если Заглавная И ПредыдущаяСтрочная Тогда
			Результат = Результат + "_";
		КонецЕсли;
		ПредыдущаяСтрочная = Не Заглавная И ВРег(Символ) <> Символ;
		Латиница = Замены.Получить(Нижний);
		Если Латиница <> Неопределено Тогда
			Результат = Результат + Латиница;
			Разделитель = Ложь;
		ИначеЕсли СтрНайти("abcdefghijklmnopqrstuvwxyz0123456789", Нижний) > 0 Тогда
			Результат = Результат + Нижний;
			Разделитель = Ложь;
		ИначеЕсли Не Разделитель Тогда
			Результат = Результат + "_";
			Разделитель = Истина;
		КонецЕсли;
	КонецЦикла;

	Пока СтрЗаканчиваетсяНа(Результат, "_") Цикл
		Результат = Лев(Результат, СтрДлина(Результат) - 1);
	КонецЦикла;
	Если Не ЗначениеЗаполнено(Результат) Или СтрНайти("0123456789", Лев(Результат, 1)) > 0 Тогда
		Результат = "field_" + Результат;
	КонецЕсли;
	Возврат Лев(Результат, 60);

КонецФункции
